# **Machine Learning** _Day 72_
##### Name: Muhammad Hassaan
##### Date: July 19, 2024
##### Email: muhammadhassaan7896@gmail.com

# **Data Integration**

## 1. Merging

In [1]:
import pandas as pd 

# example datasets
# data1
data1 = {
    'id': [1,2,3],
    'name': ['Ahmad', 'Ali', 'Fatima'],
    'age': [25,21,34]
}

df1 = pd.DataFrame(data1)

# data2
data2 = {
    'id': [1,2,3],
    'city': ['Karachi', 'Lahore', 'Multan'],
    'country': ['Pakistan', 'Pakistan', 'Pakistan']
    }

df2 = pd.DataFrame(data2)

In [2]:
df1.head()

   id    name  age
0   1   Ahmad   25
1   2     Ali   21
2   3  Fatima   34

In [3]:
df2.head()

   id     city   country
0   1  Karachi  Pakistan
1   2   Lahore  Pakistan
2   3   Multan  Pakistan

In [4]:
# merge both datasets
merged_df = pd.merge(df1, df2, on='id', how='inner')

merged_df.head()

   id    name  age     city   country
0   1   Ahmad   25  Karachi  Pakistan
1   2     Ali   21   Lahore  Pakistan
2   3  Fatima   34   Multan  Pakistan

## 2. Concatenation

In [8]:
import pandas as pd 

# example datasets
# data1
data1 = {
    'name': ['Ahmad', 'Ali', 'Fatima'],
    'age': [25,21,34]
}

# data2
data2 = {
    'name': ['Sara', 'Usman', 'Ayesha'],
    'age': [22,35,44]
}

# data3
data3 = {
    'city': ['Karachi', 'Lahore', 'Multan'],
    'country': ['Pakistan', 'Pakistan', 'Pakistan']
    }

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

In [9]:
# concatenating rows 
concatenated_rows = pd.concat([df1, df2])

# concatenated columns 
concatenated_columns = pd.concat([df1, df3], axis=1)

In [13]:
print(concatenated_rows) 

print('--------------------------------------------'), 

concatenated_columns

     name  age
0   Ahmad   25
1     Ali   21
2  Fatima   34
0    Sara   22
1   Usman   35
2  Ayesha   44
--------------------------------------------

     name  age     city   country
0   Ahmad   25  Karachi  Pakistan
1     Ali   21   Lahore  Pakistan
2  Fatima   34   Multan  Pakistan